In [2]:
import pandas as pd
import numpy as numpy
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
features_data = pd.read_csv("./data/Features data set.csv")

In [4]:
sales_data = pd.read_csv("./data/sales data-set.csv")

In [5]:
store_data = pd.read_csv("./data/stores data-set.csv")

In [11]:
features_data.head()

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,05/02/2010,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,12/02/2010,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,19/02/2010,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,26/02/2010,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,05/03/2010,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False

In [12]:
sales_data.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [19]:
store_data.head()

1.50       2
4855.31    2
175.64     2
8.62       2
2920.43    2
          ..
6918.65    1
3677.88    1
298.35     1
3311.95    1
2.50       1
Name: MarkDown1, Length: 4023, dtype: int64

In [ ]:
features_data.MarkDown1.value_counts()

In [ ]:
len(store_data), len(features_data), len(sales_data)